УТ_для_edt.РасширениеСмарт/src/Documents/МаркетинговыеМероприятияДокумент/МаркетинговыеМероприятияДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>МаркетинговыеМероприятияДокумент</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НаименованиеМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПользовательПоставилОценку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДемоЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяНачалаПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КлиентПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяПроведенияОт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсполнительДемоЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяПроведенияДо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗаявкаЗакрыта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed5953c0-f430-489a-959a-1c9b18a43b94">
    <name>КомуПередано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7fa85e95-3db1-4305-a9b3-eff06a2fa2c7">
    <name>КомментарийИнженера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec30e53b-638b-4a49-83b6-d35b7b34d6ab">
    <name>ЖелаемаяДатаИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="042868a1-e1b7-4bf7-a543-11f52a366a04">
    <name>Срочно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e082edc2-87c6-4a03-bd26-abd073e52e25">
    <name>ДатаНачалаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a0c18547-e9eb-4899-916a-5b2e886b3611">
    <name>смартДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="591d17b1-6b51-434c-b04d-0093a434b66e">
    <name>смартДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79791d53-7f2d-47a5-b15e-2d4440382239">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7d5fd00-7cc7-458b-aa54-a3662fea2df1">
    <name>смартПровелДемонстрацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>табПредставительКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КонтактныеЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="03d6da93-802e-4435-8914-be9c96eccc09">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>табМатериалыДляДемонстрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Материалы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>табОборудованиеДляДемонстрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Оборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="17912b24-a32a-4739-8f43-0640817b2712">
    <name>ИсполнителиДемоЗал</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6383e9aa-3573-4cd3-a1b9-c6aaa13839b5">
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b6f03615-5dad-4109-bba8-95ff63f8ee9b">
      <name>ЗатраченноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7c4a180a-c7ab-41c7-87d5-e56c178c4e3b">
      <name>СверхурочноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="99ada54f-5520-400b-baea-b5e9eec6aade">
      <name>смартКомментарийИнженера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ef823346-0d77-4fa8-aec6-a4089b82b441">
    <name>ВидыРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="860bd59b-2a0d-4e31-9ff1-f76c19d90e5c">
      <name>ВидРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4e93c4d2-6461-4800-9185-1ccaf477b170">
      <name>смартЗатраченноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a78bebfb-6d7b-435e-b9cf-a6a1ae596721">
      <name>смартСверхурочноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c3acc578-0cd3-4ba3-8977-29f9d585aea7">
      <name>смартИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e1f58398-3b23-4795-98fb-e0ab4701d5d2">
    <name>ОборудованиеДляДемонстрацииИнженер</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="59dcf85e-556e-4954-8b8b-f88d427f2fd2">
      <name>Оборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8b412641-a641-49cb-80be-6643fba5619b">
      <name>смартИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/МаркетинговыеМероприятияДокумент/Forms/ФормаСписка/Module.bsl
#Область ДоработкиСмарт

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура смартПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ смарт:Балашов #1358 22.05.2023
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	//-- смарт:Балашов #1358 22.05.2023
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   

	//++ смарт:Балашов #1358 22.05.2023
	НастроитьВидимостьДоступность();
	//-- смарт:Балашов #1358 22.05.2023
	
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.
	УстановитьУсловноеОформление();
	//-- #Б-1982 смарт: Лопато 13.02.2025
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ДокументМаркетинговыеМероприятияДокумент", 
																		 "ИЗ Документ.МаркетинговыеМероприятияДокумент КАК ДокументМаркетинговыеМероприятияДокумент", 
																		 "*",
																		 , "КлиентПартнер",, "КлиентПартнер");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
	//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
	Если НЕ Пользователи.РолиДоступны("смартПросмотрОценокМаркетинговыхМероприятий") Тогда  
		БлокируемыеПоля = Новый Массив;
		БлокируемыеПоля.Добавить("Оценка");
		БлокируемыеПоля.Добавить("Ссылка.Оценка");
	
		Список.УстановитьОграниченияИспользованияВГруппировке(БлокируемыеПоля);
		Список.УстановитьОграниченияИспользованияВОтборе(БлокируемыеПоля);
		Список.УстановитьОграниченияИспользованияВПорядке(БлокируемыеПоля); 
	КонецЕсли;
	//-- #6604 смарт: Тимофеева 08.05.2026
	
КонецПроцедуры

//++ смарт:Балашов #1358 22.05.2023
&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	ЭлементыКП = ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы;
	Для Каждого ЭлементКП Из ЭлементыКП Цикл 
		Если ЭлементКП.Имя = "ФормаОбщаяКомандаИсторияИзменений" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель); 
		ИначеЕсли ЭлементКП.Имя = "ФормаСоздать" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(0));
		ИначеЕсли ЭлементКП.Имя = "ФормаСкопировать" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(1));
		ИначеЕсли ЭлементКП.Имя = "ФормаПровести" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(2));
		ИначеЕсли ЭлементКП.Имя = "ФормаОтменаПроведения" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(3));
		ИначеЕсли ЭлементКП.Имя = "ФормаЗакрыть" Тогда
			Элементы.Переместить(ЭлементКП,ЭтаФорма.КоманднаяПанель,ЭлементыКП.Получить(4));
		КонецЕсли;	
	КонецЦикла;	     
	
	
	
КонецПроцедуры //-- смарт:Балашов #1358 22.05.2023

//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.
&НаСервере
Процедура УстановитьУсловноеОформление()

    СписокСтатусов = Новый СписокЗначений;
    СписокСтатусов.Добавить(Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта);
    СписокСтатусов.Добавить(Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокСтатусов;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(153, 153, 153));
	
	//++ #6604 смарт: Тимофеева 08.05.2026 / Оценка демонстрации сделать невидимым
	Если НЕ Пользователи.РолиДоступны("смартПросмотрОценокМаркетинговыхМероприятий") Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();

		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Оценка.Имя); 
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Оценка");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ПользовательПоставилОценку");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ОтборЭлемента.ПравоеЗначение = Пользователи.ТекущийПользователь();
	
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "***");
	КонецЕсли;
	//-- #6604 смарт: Тимофеева 08.05.2026

КонецПроцедуры //-- #Б-1982 смарт: Лопато 13.02.2025

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПечататьДокументНаСервере(ТабличныйДокумент, ПараметрКоманды)
	Документы.МаркетинговыеМероприятияДокумент.ПечатьЧерезОбщуюФорму(ТабличныйДокумент, ПараметрКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ПечататьДокумент(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЭтотИмяФормы = ЭтотОбъект.ИмяФормы;
	ТабДокумент = Новый ТабличныйДокумент;
	ПечататьДокументНаСервере(ТабДокумент, ПараметрКоманды);
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("МакетЗаявкаНаДемонстрацию");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "МакетЗаявкаНаДемонстрацию");
	ПечатнаяФорма.СинонимМакета = "МакетЗаявкаНаДемонстрацию";
	ПечатнаяФорма.ТабличныйДокумент = ТабДокумент;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = "Макет";
	
	ОбластиОбъектов = Новый СписокЗначений;
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	//ТабДокумент.показать();
КонецПроцедуры

#КонецОбласти
#КонецОбласти
